sample/k8s/horizontal/k8s-sn-wrk-mixed-c6525-25g-exp14-havail0-hori0-verti1-infi1-t4-c512-d30-R20000
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=20000
Running 30s test @ http://localhost:8080
  4 threads and 512 connections
  Thread calibration: mean lat.: 1613.785ms, rate sampling interval: 6868ms
  Thread calibration: mean lat.: 1661.056ms, rate sampling interval: 7020ms
  Thread calibration: mean lat.: 1859.674ms, rate sampling interval: 7286ms
  Thread calibration: mean lat.: 1660.996ms, rate sampling interval: 6991ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.83s     2.88s   14.37s    63.54%
    Req/Sec     2.90k    42.70     2.97k    75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.58s 
 75.000%    9.90s 
 90.000%   11.89s 
 99.000%   14.37s 
 99.900%   16.01s 
 99.990%   17.32s 
 99.999%   17.50s 
100.000%   17.51s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     607.231     0.000000            1         1.00
    4268.031     0.100000        22952         1.11
    5066.751     0.200000        45937         1.25
    5926.911     0.300000        68800         1.43
    6746.111     0.400000        91731         1.67
    7577.599     0.500000       114635         2.00
    8052.735     0.550000       126141         2.22
    8503.295     0.600000       137558         2.50
    8953.855     0.650000       149064         2.86
    9412.607     0.700000       160574         3.33
    9904.127     0.750000       171941         4.00
   10182.655     0.775000       177657         4.44
   10452.991     0.800000       183474         5.00
   10772.479     0.825000       189186         5.71
   11108.351     0.850000       194824         6.67
   11485.183     0.875000       200561         8.00
   11681.791     0.887500       203415         8.89
   11886.591     0.900000       206335        10.00
   12124.159     0.912500       209232        11.43
   12369.919     0.925000       212091        13.33
   12599.295     0.937500       214878        16.00
   12730.367     0.943750       216332        17.78
   12869.631     0.950000       217758        20.00
   13017.087     0.956250       219204        22.86
   13164.543     0.962500       220614        26.67
   13361.151     0.968750       222048        32.00
   13475.839     0.971875       222775        35.56
   13574.143     0.975000       223459        40.00
   13697.023     0.978125       224198        45.71
   13828.095     0.981250       224902        53.33
   14000.127     0.984375       225625        64.00
   14073.855     0.985938       225966        71.11
   14172.159     0.987500       226325        80.00
   14286.847     0.989062       226683        91.43
   14442.495     0.990625       227043       106.67
   14622.719     0.992188       227399       128.00
   14704.639     0.992969       227574       142.22
   14770.175     0.993750       227751       160.00
   14860.287     0.994531       227950       182.86
   14942.207     0.995313       228125       213.33
   15056.895     0.996094       228296       256.00
   15130.623     0.996484       228387       284.44
   15245.311     0.996875       228471       320.00
   15376.383     0.997266       228558       365.71
   15491.071     0.997656       228658       426.67
   15630.335     0.998047       228736       512.00
   15695.871     0.998242       228784       568.89
   15761.407     0.998437       228825       640.00
   15843.327     0.998633       228872       731.43
   15949.823     0.998828       228920       853.33
   16023.551     0.999023       228964      1024.00
   16089.087     0.999121       228984      1137.78
   16179.199     0.999219       229005      1280.00
   16293.887     0.999316       229029      1462.86
   16449.535     0.999414       229051      1706.67
   16572.415     0.999512       229072      2048.00
   16719.871     0.999561       229084      2275.56
   16769.023     0.999609       229094      2560.00
   16924.671     0.999658       229105      2925.71
   17039.359     0.999707       229117      3413.33
   17170.431     0.999756       229128      4096.00
   17203.199     0.999780       229133      4551.11
   17235.967     0.999805       229142      5120.00
   17252.351     0.999829       229144      5851.43
   17285.119     0.999854       229151      6826.67
   17301.503     0.999878       229158      8192.00
   17301.503     0.999890       229158      9102.22
   17317.887     0.999902       229162     10240.00
   17334.271     0.999915       229166     11702.86
   17350.655     0.999927       229171     13653.33
   17350.655     0.999939       229171     16384.00
   17350.655     0.999945       229171     18204.44
   17383.423     0.999951       229172     20480.00
   17416.191     0.999957       229175     23405.71
   17416.191     0.999963       229175     27306.67
   17432.575     0.999969       229178     32768.00
   17432.575     0.999973       229178     36408.89
   17432.575     0.999976       229178     40960.00
   17448.959     0.999979       229179     46811.43
   17448.959     0.999982       229179     54613.33
   17481.727     0.999985       229180     65536.00
   17481.727     0.999986       229180     72817.78
   17498.111     0.999988       229181     81920.00
   17498.111     0.999989       229181     93622.86
   17498.111     0.999991       229181    109226.67
   17514.495     0.999992       229183    131072.00
   17514.495     1.000000       229183          inf
#[Mean    =     7825.386, StdDeviation   =     2882.604]
#[Max     =    17498.112, Total count    =       229183]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  349511 requests in 30.02s, 359.06MB read
  Non-2xx or 3xx responses: 1806
Requests/sec:  11641.65
Transfer/sec:     11.96MB